# CreateImgFromSymbol

## Description
```pascal
FUNCTION CreateImgFromSymbol(
				symbolName   : STRING;
				symbolHeight : INTEGER;
				symbolWidth  : INTEGER;
				symbolMargin : INTEGER;
				renderMode   : INTEGER;
				view         : INTEGER) : HANDLE;
```

```python

def vs.CreateImgFromSymbol(symbolName, symbolHeight, symbolWidth, symbolMargin, renderMode, view):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|symbolName|STRING|The name of the symbol to display.|
|symbolHeight|INTEGER|The height of the symbol to display.|
|symbolWidth|INTEGER|The width of the symbol to display.|
|symbolMargin|INTEGER|The margin of the symbol to display.|
|renderMode|INTEGER|The render mode in which to display the symbol.|
|view|INTEGER|The standard view in which to display the symbol.|

## Returns
Returns the handle to the newly create image resource if successful; nil otherwise.

## Version
Availability: from Vectorworks 2018
## Category
* Document Attributes